In [3]:
import pandas as pd

df1 = pd.DataFrame({'A': ['A0', 'A1'], 'B': ['B0', 'B1']})
df2 = pd.DataFrame({'A': ['A2', 'A3'], 'B': ['B2', 'B3']})

df1

    A   B
0  A0  B0
1  A1  B1

In [4]:
df2

    A   B
0  A2  B2
1  A3  B3

In [5]:
result = pd.concat([df1, df2])
result

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [7]:
result = pd.concat([df1, df2], keys=['x', 'y'])
result

      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [8]:
result = pd.concat([df1, df2], axis=1)
result

    A   B   A   B
0  A0  B0  A2  B2
1  A1  B1  A3  B3

In [10]:
result = pd.concat([df1, df2], axis=0) # default axis = 0
result

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [12]:
result = pd.concat([df1, df2], ignore_index=True) # default is False
result

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [13]:
df3 = pd.DataFrame({'A': ['A4', 'A5'], 'C': ['C4', 'C5']})
df3

    A   C
0  A4  C4
1  A5  C5

In [14]:
df1

    A   B
0  A0  B0
1  A1  B1

In [16]:
result = pd.concat([df1, df3], sort=False, ignore_index = True)
result

    A    B    C
0  A0   B0  NaN
1  A1   B1  NaN
2  A4  NaN   C4
3  A5  NaN   C5

In [18]:
result = pd.concat([df1, df3], axis=1, join='inner') 
# Only the columns that exist in both dataframes are returned
result

    A   B   A   C
0  A0  B0  A4  C4
1  A1  B1  A5  C5

In [21]:
result = pd.concat([df1, df3], axis=1, join='outer') 
# Only the columns that exist in both dataframes are returned
result

    A   B   A   C
0  A0  B0  A4  C4
1  A1  B1  A5  C5

In [27]:
s1 = pd.Series(['X0', 'X1'], name='X')
result = pd.concat([df1, s1], axis=1)

In [28]:
df1

    A   B
0  A0  B0
1  A1  B1

In [29]:
s1

0    X0
1    X1
Name: X, dtype: object

In [32]:

result = pd.concat([df1, s1], axis=1)
result

    A   B   X
0  A0  B0  X0
1  A1  B1  X1

In [33]:
result = pd.concat([df1, df2], keys=['group1', 'group2'])
result

           A   B
group1 0  A0  B0
       1  A1  B1
group2 0  A2  B2
       1  A3  B3

In [34]:
result = df1.append(df2)
result

C:\Users\Administrator.DESKTOP-QSF3VEN\AppData\Local\Temp\ipykernel_33672\2184179823.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  result = df1.append(df2)

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3